{
    "proj": [
        {
            "name": "OEIS",
            "link": "OEIS",
            "desc": "The ongoing quest to program every sequence in the OEIS database (using Golang)",
            "long": "This is a console program that contains hundreds of algorithms to generate the sequences found in the OEIS database. While some are trivial, such as all 0s, others are more complicated and involve more complex algorithms.",
            "lang": ["golang.png"],
            "skil": ["Algorithms","Arbitrary Precision","Complex Mathematical Operations","Recursion"]
        },
        {
            "name": "Java Tic-Tac-Toe",
            "link": "TicTacToeJava",
            "desc": "An implementation of tic-tac-toe in Java",
            "long": "A desktop Java application I wrote shortly after my Sudoku game. I wrote this to teach myself AWT/Swing in Java. It has an AI computer, implemented based of the minimax algorithm. Difficulties are based on modifying this algorithm to make mistakes every once in a while.",
            "lang": ["java.png"],
            "skil": ["AWT/Swing","GUI","Object-Oriented Programming"]
        },
        {
            "name": "Java Sudoku",
            "link": "SudokuJava",
            "desc": "An implementation of sudoku in Java",
            "long": "A desktop Java application I wrote in 2019 to teach myself AWT/Swing (along with the Tic-Tac-Toe Java program).",
            "lang": ["java.png"],
            "skil": ["AWT/Swing","GUI","Object-Oriented Programming"]
        },
        {
            "name": "num2words",
            "link": "num2words",
            "desc": "A Golang package that converts a number to its English representation.",
            "long": "While it might not seem that complicated, this actually allows a number of any size. Arbitrary precision in Golang allowed me to convert a number of any size into English.",
            "lang": ["golang.png"],
            "skil": ["String Manipulation","Recursion","Arbitrary Precision"]
        },
        {
            "name": "gobig",
            "link": "gobig",
            "desc": "A simple Go package to make using arbitrary precision in Golang a bit easier",
            "long": "Golang's arbitrary precision is painful to use when performing mathematical operations on numbers. I made it easier for myself. I wrote this package primarily to use in my OEIS repo.",
            "lang": ["golang.png"],
            "skil": ["Developing a Go package","Arbitrary Precision"]
        },
        {
            "name": "Rosalind",
            "link": "rosalind",
            "desc": "Algorithms for problems from Rosalind, a bioinformatics programming platform.",
            "long": "Rosalind is a site that has problems to write algorithms or solutions for. This repo contains a few solutions to those problems.",
            "lang": ["golang.png"],
            "skil": ["Algorithms","String Manipulation","Recursion"]
        },
        {
            "name": "csort",
            "link": "csort",
            "desc": "Sorting algorithms written in C++",
            "long": "Those crazy cool sorting algorithms, but they're written in C++.",
            "lang": ["c++.png"],
            "skil": ["Algorithms","Sorting","Recursion","Iteration"]
        },
        {
            "name": "gosort",
            "link": "gosort",
            "desc": "Sorting algorithms written in Golang",
            "long": "Those crazy cool sorting algorithms, but they're written in golang.",
            "lang": ["golang.png"],
            "skil": ["Algorithms","Sorting","Recursion","Iteration"]
        }
    ]
}