{
    "web": [
        {
            "name": "R6S Roulette",
            "link": "r6siege",
            "desc": "A site to change how you play Rainbow Six Siege",
            "imgs": [
                    "r6s_1.png",
                    "r6s_2.png",
                    "r6s_3.png",
                    "r6s_4.png",
                    "r6s_5.png",
                    "r6s_6.png"
                ],
            "lang": ["HTML.png", "CSS.png", "JavaScript.png"],
            "long": "R6S Roulette is a website serving multiple purposes. It's primary purpose is to allow users to randomly generate an operator or gun in Ubisoft's game, Tom Clancy's Rainbow Six Siege. The user can filter out the full dataset via UI elements such as checkboxes and selection dropdowns.Additionally, users can view information about the operatorsor guns of the game. The data is stored in manually-written JSONs, and imported for use." 
        },
        {
            "name": "Tic-Tac-Toe",
            "link": "tic-tac-toe",
            "desc": "Tic-Tac-Toe written using ReactJS",
            "imgs": [
                    "ttt1.png",
                    "ttt2.png",
                    "ttt3.png"
                ],
            "lang": ["HTML.png", "CSS.png", "JavaScript.png", "ReactJS.svg"],
            "long": "This website is yet another rendition of the tic-tac-toe game. My first application written with ReactJS, it establishes the use of ReactJS basics like <code>React.createElement</code> and <code>ReactDOM.createRoot</code> to build the site. The AI is based on the minimax algorithm."
        },
        {
        "name": "Geography Quiz",
        "link": "geography-quiz",
        "desc": "Test your geography skills with this quiz.",
        "imgs": [
                "geo_1.png",
                "geo_2.png",
                "geo_3.png"
            ],
        "lang": ["HTML.png", "CSS.png", "JavaScript.png"],
        "long": "My geography quiz is a quiz that allows users to interact with a map of a chosen continent and select the randomly generated country. Each quiz runs through the entire continent and tracks the user's score."
        },
        {
            "name": "Unit Converter",
            "link": "unit-converter",
            "desc": "A clean and simple unit converter",
            "imgs": [
                    "uc_1.png",
                    "uc_2.png"
                ],
            "lang": ["HTML.png", "CSS.png", "JavaScript.png"],
            "long": "My unit converter is a site that allows for the conversion of various unit types; including length, area, volume, mass, time, energy, and temperature. There is a formula that is shown that can be used by the user to approximate the conversion."
        },
        {
            "name": "WebGL Demos",
            "link": "webgl-demos",
            "desc": "The landing page for my WebGL demos",
            "imgs": [
                    "webgl_1.png",
                    "webgl_2.png",
                    "webgl_3.png",
                    "webgl_4.png",
                    "webgl_5.png"
                ],
            "lang": ["HTML.png", "CSS.png", "JavaScript.png"],
            "long": "My WebGL demos demonstrate my ability to use WebGL. These demos range from something simple like basic animation to more complicated demos such as lighting and shading."
        }
    ]
}